
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

31-user 2-core Stata network perpetual license:
       Serial number:  501506227524
         Licensed to:  Woodrow Wilson School
                       Princeton University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do Analysis2.do 

. cd "/Users/slackner/Google Drive/Research/Publications/EQSurface/Code/Dat
> aAnalysis"
/Users/slackner/Google Drive/Research/Publications/EQSurface/Code/DataAnaly
> sis

. do Data_Overview

. local path "/Users/slackner/Google Drive/Research/Publications/EQSurface/
> Data/Built/"

. 
. use "`path'ThreeEQSets_combined.dta", clear

. 
. *eqlshakemap is 1 when a shakemap is supposed to exist according to ComCat. It
>  is zerro if a ShakeMap could be found even though ComCat doesn't indicate tha
> t it has one. And -1 if there is no ShakeMap for that event.
. replace eqlshakemap=-1 if eqlshakemap==.
(164 real changes made)

. gen shakemapyes=(smind~=.)

. 
. ta shakemapyes eqlshakemap if year<2016 | month<11

shakemapye |           eqlshakemap
         s |        -1          0          1 |     Total
-----------+---------------------------------+----------
         0 |       136    210,671        127 |   210,934 
         1 |        16      9,409      5,183 |    14,608 
-----------+---------------------------------+----------
     Total |       152    220,080      5,310 |   225,542 


. 
. codebook magnitude if shakemapyes==1 & eqlshakemap==1 & (year<2016 | month<11)

--------------------------------------------------------------------------------
magnitude                                                            (unlabeled)
--------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [.5,9.5]                     units:  .01
         unique values:  233                      missing .:  0/5,183

                  mean:   4.92493
              std. dev:   1.18978

           percentiles:        10%       25%       50%       75%       90%
                              3.43       3.7       5.3       5.8       6.3

. codebook magnitude if shakemapyes==1 & eqlshakemap==0 & (year<2016 | month<11)

--------------------------------------------------------------------------------
magnitude                                                            (unlabeled)
--------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [3.61,8.4]                   units:  .01
         unique values:  162                      missing .:  0/9,409

                  mean:    5.7691
              std. dev:   .626406

           percentiles:        10%       25%       50%       75%       90%
                               4.9       5.5       5.7       6.1       6.6

. 
. codebook magnitude if shakemapyes==0 & eqlshakemap==1 & (year<2016 | month<11)

--------------------------------------------------------------------------------
magnitude                                                            (unlabeled)
--------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [3.03,6.6]                   units:  .01
         unique values:  93                       missing .:  0/127

                  mean:   4.38606
              std. dev:   .559727

           percentiles:        10%       25%       50%       75%       90%
                              3.63      4.04      4.47      4.67      4.99

. count if magnitude<4.5 & shakemapyes==0 & eqlshakemap==1 & (year<2016 | month<
> 11)
  67

. 
. ***********************************************
. codebook impi_d if (year<2016 | month<11)

--------------------------------------------------------------------------------
impi_d                                                                       I_D
--------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [4211,10233]                 units:  1
         unique values:  2,130                    missing .:  223,412/225,542

                  mean:   6451.04
              std. dev:   1882.84

           percentiles:        10%       25%       50%       75%       90%
                            4560.5      5005    5632.5      7800    9889.5

. 
. count if shakemapyes==1 & (year<2016 | month<11)
  14,608

. count if shakemapyes==1 & eqlshakemap==-1 & impi_d~=. & (year<2016 | month<11)
  16

. count if shakemapyes==1 & eqlshakemap~=-1 & impi_d~=. & (year<2016 | month<11)
  1,531

. count if shakemapyes==1 & eqlshakemap~=-1 & impi_d==. & (year<2016 | month<11)
  13,061

. 
. count if magnitude>=4.5 & shakemapyes==1 & (year<2016 | month<11)
  12,388

. 
. ta shakemapyes eqlshakemap if (year<2016 | month<11) & impi_d==.

shakemapye |      eqlshakemap
         s |         0          1 |     Total
-----------+----------------------+----------
         0 |   210,225        126 |   210,351 
         1 |     8,464      4,597 |    13,061 
-----------+----------------------+----------
     Total |   218,689      4,723 |   223,412 


. ta shakemapyes eqlshakemap if (year<2016 | month<11) & impi_d~=.

shakemapye |           eqlshakemap
         s |        -1          0          1 |     Total
-----------+---------------------------------+----------
         0 |       136        446          1 |       583 
         1 |        16        945        586 |     1,547 
-----------+---------------------------------+----------
     Total |       152      1,391        587 |     2,130 


. 
. codebook magnitude impdeaths if eqlshakemap==-1 & impi_d~=. & (year<2016 | mon
> th<11)

--------------------------------------------------------------------------------
magnitude                                                            (unlabeled)
--------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1.6,7.8]                    units:  .1
         unique values:  41                       missing .:  0/152

                  mean:   4.83355
              std. dev:   .986125

           percentiles:        10%       25%       50%       75%       90%
                               3.8       4.3       4.8      5.35       5.7

--------------------------------------------------------------------------------
impdeaths                                                                 DEATHS
--------------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [1,80]                       units:  1
         unique values:  22                       missing .:  98/152

                  mean:   11.7222
              std. dev:   18.9063

           percentiles:        10%       25%       50%       75%       90%
                                 1         1         4        10        38

. count if magnitude<=5.5 & eqlshakemap==-1 & impi_d~=. & (year<2016 | month<11)
  130

. 
. codebook impdeaths if shakemapyes==0 & eqlshakemap==-1 & impi_d~=. & (year<201
> 6 | month<11)

--------------------------------------------------------------------------------
impdeaths                                                                 DEATHS
--------------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [1,80]                       units:  1
         unique values:  19                       missing .:  91/136

                  mean:   11.3111
              std. dev:   18.0187

           percentiles:        10%       25%       50%       75%       90%
                                 1         1         4        10        38

. *scatter year impdeaths if shakemapyes==0 & eqlshakemap==-1 & impi_d~=. & (yea
> r<2016 | month<11)
. 
. codebook magnitude if shakemapyes==1 & eqlshakemap==-1 & impi_d~=. & (year<201
> 6 | month<11)

--------------------------------------------------------------------------------
magnitude                                                            (unlabeled)
--------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [3.6,5.5]                    units:  .1
         unique values:  11                       missing .:  0/16

                  mean:       4.5
              std. dev:   .585377

           percentiles:        10%       25%       50%       75%       90%
                               3.8       4.2       4.3      5.05       5.4

. 
. sort magnitude

. *br magnitude impintensity impcountry impstate implocation_name impregion_code
>  impdeaths impdamage_millions_dollars if  year>1972 & magnitude>5.5 & shakemap
> yes==0 & eqlshakemap~=-1 & impi_d~=. & (year<2016 | month<11)
. 
. count if magnitude>=4.5 & year>1972 & shakemapyes==0 & eqlshakemap~=-1 & impi_
> d~=. & (year<2016 | month<11)
  239

. 
. codebook impintensity if year>1972 & shakemapyes==0 & eqlshakemap~=-1 & impi_d
> ~=. & (year<2016 | month<11)

--------------------------------------------------------------------------------
impintensity                                                           INTENSITY
--------------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [3,9]                        units:  1
         unique values:  7                        missing .:  204/240

            tabulation:  Freq.  Value
                             1  3
                             2  4
                             5  5
                            17  6
                             5  7
                             5  8
                             1  9
                           204  .

. 
. 
. sort magnitude

. gen eql=(eqlshakemap>-1)

. bysort shakemapyes eql: summarize impdeaths if  year<1970 & (year<2016 | month
> <11)

--------------------------------------------------------------------------------
-> shakemapyes = 0, eql = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   impdeaths |         27    15.40741     21.9567          1         80

--------------------------------------------------------------------------------
-> shakemapyes = 0, eql = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   impdeaths |         79    55.11392    110.3629          1        700

--------------------------------------------------------------------------------
-> shakemapyes = 1, eql = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   impdeaths |          0

--------------------------------------------------------------------------------
-> shakemapyes = 1, eql = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   impdeaths |         16    2812.375    4651.336          3      13100


. 
. *hist impdeaths if  year<1970 & (year<2016 | month<11) & shakemapyes==1 & eql=
> =1
. 
. count if eql==1 & shakemapyes==0 & impdeaths>0 & impdeaths~=.
  99

. count if eql==1 & shakemapyes==0 & impdeaths>0 & impdeaths~=. & year<=1972
  84

. 
. sum impdeaths if eql==1 & shakemapyes==0 & impdeaths>0 & impdeaths~=. & year>1
> 972

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   impdeaths |         15    2.866667     2.85023          1         11

. 
. count if eql==1 & shakemapyes==0 & year<=1972 & impi_d~=.
  207

. count if eql==1 & shakemapyes==0 & year>1972 & impi_d~=. & magnitude>=5.5
  73

. count if shakemapyes==1 & magnitude>=5.5 & (year<2016 | month<11)
  9,780

. 
. *scatter impdeaths year if shakemapyes==0 & eqlshakemap~=-1 & impi_d~=. & (yea
> r<2016 | month<11)
. 
. *br imp* year month day smregion if impi_d~=. & (year<2016 | month<11) & eqlsh
> akemap==1 & shakemapyes==0
. 
end of do-file

. 
. cd "/Users/slackner/Google Drive/Research/Publications/EQSurface/Code/Dat
> aAnalysis"
/Users/slackner/Google Drive/Research/Publications/EQSurface/Code/DataAnaly
> sis

. do Area_summary

. clear

. clear matrix

. local path "/Users/slackner/Google Drive/Research/Publications/EQSurface/
> "

. set more off

. 
. use "`path'Data/Built/ShakeMapInfo.dta", clear

. 
. merge 1:1 id using "`path'Data/Built/PGA.dta", nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            14,612  
    -----------------------------------------

. merge 1:1 id using "`path'Data/Built/epicenter.dta", nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            14,612  
    -----------------------------------------

. 
. drop if year>=2016 & month>=11
(4 observations deleted)

. 
. 
. gen mag_cat="4.5" if magnitude<4.5
(12,388 missing values generated)

. replace mag_cat="4.5-5.5" if magnitude>=4.5 &magnitude<5.5
variable mag_cat was str3 now str7
(2,608 real changes made)

. replace mag_cat="5.5-6" if magnitude>=5.5 &magnitude<6
(5,639 real changes made)

. replace mag_cat="6-6.5" if magnitude>=6 &magnitude<6.5
(2,502 real changes made)

. replace mag_cat="6.5-7" if magnitude>=6.5 &magnitude<7
(1,073 real changes made)

. replace mag_cat="7-7.5" if magnitude>=7 &magnitude<7.5
(399 real changes made)

. replace mag_cat="7.5-8" if magnitude>=7.5 &magnitude<8
(133 real changes made)

. replace mag_cat="8" if magnitude>=8
(34 real changes made)

. 
. replace peak_pga=0 if peak_pga==.
(885 real changes made)

. gen pga="0"

. replace pga="0-10" if peak_pga>0 & peak_pga<=10
variable pga was str1 now str4
(5,911 real changes made)

. replace pga="10-20" if peak_pga>10 & peak_pga<=20
variable pga was str4 now str5
(4,476 real changes made)

. replace pga="20-40" if peak_pga>20 & peak_pga<=40
(2,728 real changes made)

. replace pga="40-80" if peak_pga>40 & peak_pga<=80
(498 real changes made)

. replace pga=">80" if peak_pga>80
(110 real changes made)

. 
. replace area_above1000pga=area_above1000pga/100
(7,812 real changes made)

. 
. 
. 
. tabout mag_cat pga using "`path'Output/Tables/tab03.txt" if peak_pga>10, repla
> ce c(mean area_above1000pga) f(0) style(tex) sum

Table output written to: /Users/slackner/Google Drive/Research/Projects/Earthqua
> kesSurface/Output/Tables/tab03.txt

 & \multicolumn{5}{c}{pga} \\
mag\_cat&10-20&20-40&40-80&>80&Total \\
&Mean area above1000pga&Mean area above1000pga&Mean area above1000pga&Mean area 
> above1000pga&Mean area above1000pga \\
\hline
4.5&1&4&6&&3 \\
4.5-5.5&3&6&17&19&4 \\
5.5-6&6&14&22&36&9 \\
6-6.5&8&25&43&62&17 \\
6.5-7&30&63&75&135&56 \\
7-7.5&8&145&154&247&136 \\
7.5-8&12&199&251&551&242 \\
8&9&186&710&685&443 \\
Total&7&35&87&221&25 \\

. 
. tabout mag_cat pga using "`path'Output/Tables/tab04.txt", replace c(N peak_pga
> ) f(0) style(tex) sum

Table output written to: /Users/slackner/Google Drive/Research/Projects/Earthqua
> kesSurface/Output/Tables/tab04.txt

 & \multicolumn{7}{c}{pga} \\
mag\_cat&0&0-10&10-20&20-40&40-80&>80&Total \\
&N peak pga&N peak pga&N peak pga&N peak pga&N peak pga&N peak pga&N peak pga \\
\hline
4.5&7&1593&242&277&101&0&2220 \\
4.5-5.5&67&1263&853&390&34&1&2608 \\
5.5-6&606&2070&2132&773&46&12&5639 \\
6-6.5&156&716&888&649&72&21&2502 \\
6.5-7&34&203&295&392&125&24&1073 \\
7-7.5&10&48&51&189&68&33&399 \\
7.5-8&4&15&12&47&41&14&133 \\
8&1&3&3&11&11&5&34 \\
Total&885&5911&4476&2728&498&110&14608 \\

. 
. keep if peak_pga>0
(885 observations deleted)

. 
. tabout mag_cat pga using "`path'Output/Tables/tab02.txt", replace c(mean area_
> with09percentpeakpga) f(0) style(tex) sum

Table output written to: /Users/slackner/Google Drive/Research/Projects/Earthqua
> kesSurface/Output/Tables/tab02.txt

 & \multicolumn{6}{c}{pga} \\
mag\_cat&0-10&10-20&20-40&40-80&>80&Total \\
&Mean area with09percentpeakpga&Mean area with09percentpeakpga&Mean area with09p
> ercentpeakpga&Mean area with09percentpeakpga&Mean area with09percentpeakpga&Me
> an area with09percentpeakpga \\
\hline
4.5&16&11&14&14&&15 \\
4.5-5.5&149&63&30&31&22&100 \\
5.5-6&332&78&63&34&41&180 \\
6-6.5&544&106&89&74&44&234 \\
6.5-7&714&237&237&150&81&316 \\
7-7.5&542&31&609&352&117&439 \\
7.5-8&2448&67&589&456&230&675 \\
8&2798&99&423&396&128&556 \\
Total&255&87&133&151&101&171 \\

. 
end of do-file

. 
. cd "/Users/slackner/Google Drive/Research/Publications/EQSurface/Code/Dat
> aAnalysis"
/Users/slackner/Google Drive/Research/Publications/EQSurface/Code/DataAnaly
> sis

. do Center_Distances

. clear matrix

. set more off

. local path "/Users/slackner/Google Drive/Research/Publications/EQSurface/
> "

. 
. use "`path'Data/Built/ShakeMapInfo.dta", clear

. 
. merge 1:1 id using "`path'Data/Built/PGA.dta", nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            14,612  
    -----------------------------------------

. merge 1:1 id using "`path'Data/Built/epicenter.dta", nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            14,612  
    -----------------------------------------

. 
. drop if year>=2016 & month>=11
(4 observations deleted)

. 
. *i=32 in Matlab is an example of epicenter not in shakemap, confirmed with dat
> a
. 
. *replace ec_pga=0 if ec_pga==-1
. gen ecinwater=1

. replace ecinwater=0 if ec_pga>0 & ec_pga~=.
(7,170 real changes made)

. ta ecinwater if magnitude>=4.5

  ecinwater |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,285       42.66       42.66
          1 |      7,103       57.34      100.00
------------+-----------------------------------
      Total |     12,388      100.00

. 
. drop if dist_ec_sc_pga==. | magnitude<4.5
(3,098 observations deleted)

. ta ecinwater if magnitude>=4.5

  ecinwater |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,285       45.92       45.92
          1 |      6,225       54.08      100.00
------------+-----------------------------------
      Total |     11,510      100.00

. 
. gen sameecsc=0

. replace sameecsc=1 if ec_pga==sc_pga & ec_pga>0 & ec_pga~=.
(1,035 real changes made)

. gen sameecsct=0

. replace sameecsct=1 if ec_pga==sct_pga & ec_pga>0 & ec_pga~=.
(1,295 real changes made)

. 
. gen samescsct=0

. replace samescsct=1 if sc_pga==sct_pga & sct_pga>0 & sct_pga~=.
(1,963 real changes made)

. 
. replace dist_ec_sc_pga=0 if sameecsc==1
(1,035 real changes made)

. replace dist_ec_sct_pga=0 if sameecsct==1
(1,295 real changes made)

. replace dist_sc_sct_pga=0 if samescsct==1
(1,872 real changes made)

. 
. tabout ecinwater using "`path'Output/Tables/tab01.txt", replace bt c(mean dist
> _ec_sc_pga sd dist_ec_sc_pga max dist_ec_sc_pga mean dist_ec_sct_pga sd dist_e
> c_sct_pga max dist_ec_sct_pga mean dist_sc_sct_pga sd dist_sc_sct_pga max dist
> _sc_sct_pga) f(0) npos(tufte) style(tex) sum

Table output written to: /Users/slackner/Google Drive/Research/Projects/Earthqua
> kesSurface/Output/Tables/tab01.txt

ecinwater&Mean&Sd&Max&Mean&Sd&Max&Mean&Sd&Max \\
&dist ec sc pga&dist ec sc pga&dist ec sc pga&dist ec sct pga&dist ec sct pga&di
> st ec sct pga&dist sc sct pga&dist sc sct pga&dist sc sct pga \\
\midrule
0 (45\%)&7&13&362&5&10&313&7&13&355 \\
1 (54\%)&53&53&1022&59&54&682&25&33&445 \\
Total (100\%)&32&46&1022&35&48&682&16&28&445 \\

. 
. gen ldist=log10(dist_ec_sc_pga+0.1)

. label var ldist "km"

. 
. set scheme s1color

. twoway (histogram ldist if ecinwater==0 & magnitude>=4.5, frequency width(0.2)
>  start(-1.1) lcolor(brown) xtick(-1 0 1 2 3) xlabel(-1 "0" 0 "1" 1 "10" 2 "100
> " 3 "1000") ) ///
>        (histogram ldist if ecinwater==1 & magnitude>=4.5, frequency width(0.2)
>  start(-1.1) fcolor(none) lcolor(blue)), legend(order(1 "Epicenter on land" 2 
> "Epicenter in water" )) title("Distribution of distance between SC and EC")

. graph export "`path'Output/Figures/Figure04.pdf", replace
(file /Users/slackner/Google Drive/Research/Publications/EQSurface/Output/F
> igures/Figure04.pdf written in PDF format)

. 
. 
. count if magnitude>=4.5 & ec_pga>0 &  ec_pga~=.
  5,285

. 
. cap drop relPGA_EC_SC

. gen relPGA_EC_SC=(sc_pga-ec_pga)/sc_pga

. 
. sum relPGA_EC_SC if ecinwater==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
relPGA_EC_SC |      5,285    .1324978    .1424866          0   .8741811

. 
. ta sameecsc

   sameecsc |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,475       91.01       91.01
          1 |      1,035        8.99      100.00
------------+-----------------------------------
      Total |     11,510      100.00

. 
end of do-file

. 
. cd "/Users/slackner/Google Drive/Research/Publications/EQSurface/Code/Dat
> aAnalysis"
/Users/slackner/Google Drive/Research/Publications/EQSurface/Code/DataAnaly
> sis

. do CompareEQ_data_Sets

. set more off

. local path "/Users/slackner/Google Drive/Research/Publications/EQSurface/
> "

. 
. use "`path'Data/Built/ThreeEQSets_combined.dta", clear

. gen mag1D=round(magnitude,0.1)

. label var mag1D "Magnitude"

. label var year "Year"

. drop if year>=2016 & month>=11
(12 observations deleted)

. drop if mag1D<2
(3 observations deleted)

. 
. gen smeq=1 if smind~=.
(210,933 missing values generated)

. replace smeq=0 if smeq==.
(210,933 real changes made)

. 
. gen death=1 if impdeaths>0 & impdeaths~=.
(224,641 missing values generated)

. *hist impdeaths if death==1 & smeq~=1, frequency
. set scheme s1color

. preserve

. * NORTH AMERICA VS NOT NORTH AMERICA RATIO OF SHAKEMAPS
. drop if smeq==.
(0 observations deleted)

. drop if year<1973
(4,167 observations deleted)

. gen NorthAmerica=0

. replace NorthAmerica=1 if lat<=70 & lat>=25 & lon<=-60 & lon>=-170
(8,285 real changes made)

. 
. ta NorthAmerica

NorthAmeric |
          a |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    213,087       96.26       96.26
          1 |      8,285        3.74      100.00
------------+-----------------------------------
      Total |    221,372      100.00

. 
. gen mag_ref=.
(221,372 missing values generated)

. gen ratioNNA=.
(221,372 missing values generated)

. gen ratioNA=.
(221,372 missing values generated)

. label var ratioNNA "Not North America"

. label var ratioNA "North America"

. label var mag_ref "Magnitude"

. 
. local k=1

. forval i=4.5(0.1)9 {
  2.         replace mag_ref=`i' in `k'
  3.         disp `i'
  4.         count if NorthAmerica==0 & mag1D>=`i'-0.01 & mag1D<=`i'+0.01
  5.         local numNNA=`r(N)'
  6.         count if NorthAmerica==1 & mag1D>=`i'-0.01 & mag1D<=`i'+0.01
  7.         local numNA=`r(N)'
  8.         count if NorthAmerica==0 & mag1D>=`i'-0.01 & mag1D<=`i'+0.01 & smeq
> ==1
  9.         local numNNA_sm=`r(N)'
 10.         count if NorthAmerica==1 & mag1D>=`i'-0.01 & mag1D<=`i'+0.01 & smeq
> ==1
 11.         local numNA_sm=`r(N)'
 12. 
.         replace ratioNNA=`numNNA_sm'/`numNNA' in `k'
 13.         replace ratioNA=`numNA_sm'/`numNA' in `k'
 14.         local k=`k'+1
 15. }
(1 real change made)
4.5
  35,854
  1,142
  202
  86
(1 real change made)
(1 real change made)
(1 real change made)
4.6
  33,589
  982
  205
  70
(1 real change made)
(1 real change made)
(1 real change made)
4.7
  29,544
  857
  174
  70
(1 real change made)
(1 real change made)
(1 real change made)
4.8
  24,949
  686
  178
  58
(1 real change made)
(1 real change made)
(1 real change made)
4.9
  19,073
  504
  168
  50
(1 real change made)
(1 real change made)
(1 real change made)
5
  14,823
  397
  133
  33
(1 real change made)
(1 real change made)
(1 real change made)
5.1
  11,872
  335
  140
  42
(1 real change made)
(1 real change made)
(1 real change made)
5.2
  9,686
  257
  235
  29
(1 real change made)
(1 real change made)
(1 real change made)
5.3
  7,268
  201
  234
  24
(1 real change made)
(1 real change made)
(1 real change made)
5.4
  5,959
  181
  456
  22
(1 real change made)
(1 real change made)
(1 real change made)
5.5
  4,542
  140
  1,440
  46
(1 real change made)
(1 real change made)
(1 real change made)
5.6
  3,508
  96
  1,254
  33
(1 real change made)
(1 real change made)
(1 real change made)
5.7
  2,581
  83
  1,058
  43
(1 real change made)
(1 real change made)
(1 real change made)
5.8
  1,981
  63
  888
  31
(1 real change made)
(1 real change made)
(1 real change made)
5.9
  1,643
  46
  771
  19
(1 real change made)
(1 real change made)
(1 real change made)
6
  1,283
  51
  656
  24
(1 real change made)
(1 real change made)
(1 real change made)
6.1
  988
  23
  571
  10
(1 real change made)
(1 real change made)
(1 real change made)
6.2
  741
  29
  415
  15
(1 real change made)
(1 real change made)
(1 real change made)
6.3
  647
  18
  418
  11
(1 real change made)
(1 real change made)
(1 real change made)
6.4
  479
  8
  317
  3
(1 real change made)
(1 real change made)
(1 real change made)
6.5
  368
  18
  256
  11
(1 real change made)
(1 real change made)
(1 real change made)
6.6
  332
  23
  259
  16
(1 real change made)
(1 real change made)
(1 real change made)
6.7
  229
  8
  183
  2
(1 real change made)
(1 real change made)
(1 real change made)
6.8
  191
  9
  153
  5
(1 real change made)
(1 real change made)
(1 real change made)
6.9
  159
  10
  137
  9
(1 real change made)
(1 real change made)
(1 real change made)
7
  114
  4
  101
  4
(1 real change made)
(1 real change made)
(1 real change made)
7.1
  112
  5
  98
  4
(1 real change made)
(1 real change made)
(1 real change made)
7.2
  79
  3
  67
  3
(1 real change made)
(1 real change made)
(1 real change made)
7.3
  56
  2
  53
  2
(1 real change made)
(1 real change made)
(1 real change made)
7.4
  44
  0
  39
  0
(1 real change made)
(0 real changes made)
(1 real change made)
7.5
  38
  2
  36
  2
(1 real change made)
(1 real change made)
(1 real change made)
7.6
  35
  0
  29
  0
(1 real change made)
(0 real changes made)
(1 real change made)
7.7
  32
  1
  29
  1
(1 real change made)
(1 real change made)
(1 real change made)
7.8
  20
  2
  18
  2
(1 real change made)
(1 real change made)
(1 real change made)
7.9
  13
  2
  10
  1
(1 real change made)
(1 real change made)
(1 real change made)
8
  10
  0
  8
  0
(1 real change made)
(0 real changes made)
(1 real change made)
8.1
  7
  0
  5
  0
(1 real change made)
(0 real changes made)
(1 real change made)
8.2
  6
  0
  5
  0
(1 real change made)
(0 real changes made)
(1 real change made)
8.3
  6
  0
  6
  0
(1 real change made)
(0 real changes made)
(1 real change made)
8.4
  2
  0
  2
  0
(1 real change made)
(0 real changes made)
(1 real change made)
8.5
  0
  0
  0
  0
(0 real changes made)
(0 real changes made)
(1 real change made)
8.6
  2
  0
  2
  0
(1 real change made)
(0 real changes made)
(1 real change made)
8.7
  0
  0
  0
  0
(0 real changes made)
(0 real changes made)
(1 real change made)
8.8
  1
  0
  1
  0
(1 real change made)
(0 real changes made)
(1 real change made)
8.9
  0
  0
  0
  0
(0 real changes made)
(0 real changes made)
(1 real change made)
9
  2
  0
  2
  0
(1 real change made)
(0 real changes made)

. *br mag_ref ratio*
. drop if mag_ref==.
(221,326 observations deleted)

. twoway (scatter ratioNA mag_ref, msymbol(d) color(red) xlabel(4(0.5)9)) ///
>        (scatter ratioNNA mag_ref, msymbol(d) color(navy) xlabel(4(0.5)9)), tit
> le("(a)") ytitle("Share of events with ShakeMap") legend(off)

. graph export "`path'Output/Figures/RatioShakeMaps.png", replace
(file /Users/slackner/Google Drive/Research/Publications/EQSurface/Output/F
> igures/RatioShakeMaps.png written in PNG format)

. twoway (scatter ratioNA mag_ref, msymbol(d) color(red) xlabel(4(0.5)9)) ///
>        (scatter ratioNNA mag_ref, msymbol(d) color(navy) xlabel(4(0.5)9)), yti
> tle("Share of events with ShakeMap")

. graph export "`path'Output/Figures/RatioShakeMapsLegend.png", replace
(file /Users/slackner/Google Drive/Research/Publications/EQSurface/Output/F
> igures/RatioShakeMapsLegend.png written in PNG format)

. 
. restore

. 
. preserve

. * NORTH AMERICA VS NOT NORTH AMERICA IN SHAKEMAPS
. keep if smeq==1
(210,933 observations deleted)

. gen NorthAmerica=0

. replace NorthAmerica=1 if lat<=70 & lat>=25 & lon<=-60 & lon>=-170
(2,822 real changes made)

. 
. gen mag_ref=.
(14,606 missing values generated)

. gen ratioNNA=.
(14,606 missing values generated)

. gen ratioNA=.
(14,606 missing values generated)

. label var ratioNA "Share of North American ShakeMaps"

. label var mag_ref "Magnitude"

. 
. local k=1

. forval i=0(0.1)9.5 {
  2.         replace mag_ref=`i' in `k'
  3.         disp `i'
  4.         count if mag1D>=`i'-0.01 & mag1D<=`i'+0.01
  5.         local num_all=`r(N)'
  6.         count if NorthAmerica==1 & mag1D>=`i'-0.01 & mag1D<=`i'+0.01
  7.         local numNA=`r(N)'
  8. 
.         replace ratioNA=`numNA'/`num_all' in `k'
  9.         local k=`k'+1
 10. }
(1 real change made)
0
  0
  0
(0 real changes made)
(1 real change made)
.1
  0
  0
(0 real changes made)
(1 real change made)
.2
  0
  0
(0 real changes made)
(1 real change made)
.3
  0
  0
(0 real changes made)
(1 real change made)
.4
  0
  0
(0 real changes made)
(1 real change made)
.5
  0
  0
(0 real changes made)
(1 real change made)
.6
  0
  0
(0 real changes made)
(1 real change made)
.7
  0
  0
(0 real changes made)
(1 real change made)
.8
  0
  0
(0 real changes made)
(1 real change made)
.9
  0
  0
(0 real changes made)
(1 real change made)
1
  0
  0
(0 real changes made)
(1 real change made)
1.1
  0
  0
(0 real changes made)
(1 real change made)
1.2
  0
  0
(0 real changes made)
(1 real change made)
1.3
  0
  0
(0 real changes made)
(1 real change made)
1.4
  0
  0
(0 real changes made)
(1 real change made)
1.5
  0
  0
(0 real changes made)
(1 real change made)
1.6
  0
  0
(0 real changes made)
(1 real change made)
1.7
  0
  0
(0 real changes made)
(1 real change made)
1.8
  0
  0
(0 real changes made)
(1 real change made)
1.9
  0
  0
(0 real changes made)
(1 real change made)
2
  0
  0
(0 real changes made)
(1 real change made)
2.1
  2
  2
(1 real change made)
(1 real change made)
2.2
  0
  0
(0 real changes made)
(1 real change made)
2.3
  0
  0
(0 real changes made)
(1 real change made)
2.4
  1
  1
(1 real change made)
(1 real change made)
2.5
  1
  1
(1 real change made)
(1 real change made)
2.6
  3
  3
(1 real change made)
(1 real change made)
2.7
  1
  1
(1 real change made)
(1 real change made)
2.8
  1
  1
(1 real change made)
(1 real change made)
2.9
  19
  19
(1 real change made)
(1 real change made)
3
  52
  52
(1 real change made)
(1 real change made)
3.1
  51
  51
(1 real change made)
(1 real change made)
3.2
  90
  90
(1 real change made)
(1 real change made)
3.3
  137
  135
(1 real change made)
(1 real change made)
3.4
  169
  169
(1 real change made)
(1 real change made)
3.5
  354
  344
(1 real change made)
(1 real change made)
3.6
  251
  238
(1 real change made)
(1 real change made)
3.7
  188
  171
(1 real change made)
(1 real change made)
3.8
  204
  184
(1 real change made)
(1 real change made)
3.9
  145
  127
(1 real change made)
(1 real change made)
4
  116
  106
(1 real change made)
(1 real change made)
4.1
  106
  89
(1 real change made)
(1 real change made)
4.2
  115
  91
(1 real change made)
(1 real change made)
4.3
  104
  79
(1 real change made)
(1 real change made)
4.4
  100
  80
(1 real change made)
(1 real change made)
4.5
  288
  86
(1 real change made)
(1 real change made)
4.6
  275
  70
(1 real change made)
(1 real change made)
4.7
  244
  70
(1 real change made)
(1 real change made)
4.8
  236
  58
(1 real change made)
(1 real change made)
4.9
  218
  50
(1 real change made)
(1 real change made)
5
  166
  33
(1 real change made)
(1 real change made)
5.1
  182
  42
(1 real change made)
(1 real change made)
5.2
  265
  29
(1 real change made)
(1 real change made)
5.3
  259
  24
(1 real change made)
(1 real change made)
5.4
  480
  23
(1 real change made)
(1 real change made)
5.5
  1,496
  46
(1 real change made)
(1 real change made)
5.6
  1,301
  33
(1 real change made)
(1 real change made)
5.7
  1,109
  43
(1 real change made)
(1 real change made)
5.8
  931
  31
(1 real change made)
(1 real change made)
5.9
  804
  19
(1 real change made)
(1 real change made)
6
  690
  24
(1 real change made)
(1 real change made)
6.1
  597
  11
(1 real change made)
(1 real change made)
6.2
  441
  15
(1 real change made)
(1 real change made)
6.3
  444
  11
(1 real change made)
(1 real change made)
6.4
  331
  3
(1 real change made)
(1 real change made)
6.5
  280
  12
(1 real change made)
(1 real change made)
6.6
  291
  18
(1 real change made)
(1 real change made)
6.7
  189
  3
(1 real change made)
(1 real change made)
6.8
  162
  5
(1 real change made)
(1 real change made)
6.9
  151
  9
(1 real change made)
(1 real change made)
7
  111
  4
(1 real change made)
(1 real change made)
7.1
  109
  4
(1 real change made)
(1 real change made)
7.2
  79
  3
(1 real change made)
(1 real change made)
7.3
  59
  2
(1 real change made)
(1 real change made)
7.4
  41
  0
(1 real change made)
(1 real change made)
7.5
  40
  2
(1 real change made)
(1 real change made)
7.6
  30
  0
(1 real change made)
(1 real change made)
7.7
  31
  1
(1 real change made)
(1 real change made)
7.8
  20
  2
(1 real change made)
(1 real change made)
7.9
  12
  1
(1 real change made)
(1 real change made)
8
  9
  0
(1 real change made)
(1 real change made)
8.1
  5
  0
(1 real change made)
(1 real change made)
8.2
  5
  0
(1 real change made)
(1 real change made)
8.3
  6
  0
(1 real change made)
(1 real change made)
8.4
  2
  0
(1 real change made)
(1 real change made)
8.5
  0
  0
(0 real changes made)
(1 real change made)
8.6
  2
  0
(1 real change made)
(1 real change made)
8.7
  0
  0
(0 real changes made)
(1 real change made)
8.8
  1
  0
(1 real change made)
(1 real change made)
8.9
  0
  0
(0 real changes made)
(1 real change made)
9
  2
  0
(1 real change made)
(1 real change made)
9.1
  0
  0
(0 real changes made)
(1 real change made)
9.2
  1
  1
(1 real change made)
(1 real change made)
9.3
  0
  0
(0 real changes made)
(1 real change made)
9.4
  0
  0
(0 real changes made)
(1 real change made)
9.5
  1
  0
(1 real change made)

. *br mag_ref ratio*
. drop if mag_ref==.
(14,510 observations deleted)

. drop if mag_ref<2
(20 observations deleted)

. twoway (scatter ratioNA mag_ref, msymbol(d) xscale(range(2 9)) xlabel(2(0.5)9.
> 5) title("(b)"))

. graph export "`path'Output/Figures/NorthAmericaShare.png", replace
(file /Users/slackner/Google Drive/Research/Publications/EQSurface/Output/F
> igures/NorthAmericaShare.png written in PNG format)

. restore

. 
. 
. preserve

. *EARTHQUAKES OVER MAGNITUDE
. drop if mag1D<5.5 & smind==.
(195,867 observations deleted)

. drop if year<1973
(3,956 observations deleted)

. twoway (hist mag1D if smeq~=., frequency width(0.1) start(1.95) xscale(range(1
> .9 9)) xlabel(2(0.5)9)) ///
>        (hist mag1D if smeq==1, frequency width(0.1) start(1.95) xscale(range(1
> .9 9)) xlabel(2(0.5)9) lcolor(teal) fcolor(emerald)) ///
>            (hist mag1D if smeq==1 & death==1, frequency width(0.1) xscale(rang
> e(1.9 9)) xlabel(2(0.5)9) start(1.95) color(maroon)), ytitle("Number of Earthq
> uakes") legend(order(1 "with Magnitude >= 5.5" 2 "with ShakeMap" 3 "with Shake
> Map and Fatalities") )

. graph export "`path'Output/Figures/Figure10.pdf", replace
(file /Users/slackner/Google Drive/Research/Publications/EQSurface/Output/F
> igures/Figure10.pdf written in PDF format)

. restore

. 
. preserve

. * EARTHQUAKES OVER YEARS
. drop if mag1D<4.5
(2,318 observations deleted)

. drop if mag1D>=5.5
(24,849 observations deleted)

. drop if year>2015
(5,461 observations deleted)

. twoway (hist year if smeq~=., frequency width(1) start(1959.5) xscale(range(19
> 60 2015)) xlabel(1960(5)2015) ) ///
>        (hist year if smeq==1, frequency width(1) start(1959.5) xscale(range(19
> 60 2015)) xlabel(1960(5)2015) lcolor(teal) fcolor(emerald)) ///
>            (hist year if smeq==1 & death==1, frequency width(1) start(1959.5) 
> xscale(range(1960 2015)) xlabel(1960(5)2015) color(maroon)), ytitle("Number of
>  Earthquakes with 4.5 <= Mag < 5.5") legend(order(1 "All Earthquakes" 2 "with 
> ShakeMap" 3 "with ShakeMap and Fatalities")) title("(b)")

. graph export "`path'Output/Figures/Year3DataSets45.png", replace
(file /Users/slackner/Google Drive/Research/Publications/EQSurface/Output/F
> igures/Year3DataSets45.png written in PNG format)

. 
. restore

. drop if mag1D<5.5
(200,690 observations deleted)

. drop if year>2015
(375 observations deleted)

. twoway (hist year if smeq~=., frequency width(1) start(1959.5) xscale(range(19
> 60 2015)) xlabel(1960(5)2015) ) ///
>        (hist year if smeq==1, frequency width(1) start(1959.5) xscale(range(19
> 60 2015)) xlabel(1960(5)2015) lcolor(teal) fcolor(emerald)) ///
>            (hist year if smeq==1 & death==1, frequency width(1) start(1959.5) 
> xscale(range(1960 2015)) xlabel(1960(5)2015) color(maroon)), ytitle("Number of
>  Earthquakes with Mag >= 5.5") legend(order(1 "All Earthquakes" 2 "with ShakeM
> ap" 3 "with ShakeMap and Fatalities")) title("(a)")

. graph export "`path'Output/Figures/Year3DataSets.png", replace
(file /Users/slackner/Google Drive/Research/Publications/EQSurface/Output/F
> igures/Year3DataSets.png written in PNG format)

. 
end of do-file

. 
end of do-file
